
// Необходимо реализовать автодополнение. При введении в инпут первых букв страны - появляется список стран, которые начинаются на те буквы, которые вы ввели. Чем больше букв вы вводите - тем меньше стран в списке. Страну можно выбрать, кликнув по ней мышкой - в этом случае ее название появится в инпуте.
// Массив со списком стран я уже сделал.


let countries = ["Австралия", "Австрия", "Азербайджан", "Албания", "Алжир", "Ангола", "Андорра", "Антигуа и Барбуда", "Антильские острова", "Аргентина", "Армения", "Афганистан", "Багамские острова", "Бангладеш", "Барбадос", "Бахрейн", "Белиз", "Белоруссия", "Бельгия", "Бенин", "Болгария", "Боливия", "Босния и Герцеговина", "Ботсвана", "Бразилия", "Буркина-Фасо", "Бурунди", "Бутан", "Вануату", "Ватикан", "Великобритания", "Венгрия", "Венесуэла", "Вьетнам", "Габон", "Гаити", "Гайана", "Гамбия", "Гана", "Гватемала", "Гвинея", "Гвинея-Бисау", "Германия", "Голландия", "Гондурас", "Гонконг", "Гренада", "Гренландия", "Греция", "Грузия", "Гуам", "Дания", "Демократическая Республика Конго", "Джибути", "Доминиканская республика", "Египет", "Замбия", "Западная Сахара", "Зимбабве", "Израиль", "Индия", "Индонезия", "Иордания", "Ирак", "Иран", "Ирландия", "Исландия", "Испания", "Италия", "Йемен", "Кабо-Верде", "Казахстан", "Камбоджа", "Камерун", "Канада", "Катар", "Кения", "Кипр", "Киргизия", "Кирибати", "Китай", "КНДР", "Колумбия", "Коморские острова", "Коста-Рика", "Кот-д'Ивуар", "Куба", "Кувейт", "Лаос", "Латвия", "Лесото", "Либерия", "Ливан", "Ливия", "Литва", "Лихтенштейн", "Люксембург", "Маврикий", "Мавритания", "Мадагаскар", "Македония", "Малави", "Малайзия", "Мали", "Мальдивы", "Мальта", "Марокко", "Мартиника", "Мексика", "Микронезия", "Мозамбик", "Молдавия", "Монако", "Монголия", "Мьянма", "Намибия", "Непал", "Нигер", "Нигерия", "Никарагуа", "Новая Зеландия", "Новая Каледония", "Норвегия", "ОАЭ", "Оман", "Пакистан", "Палестина", "Панама", "Папуа-Новая Гвинея", "Парагвай", "Перу", "Польша", "Португалия", "Пуэрто-Рико", "Республика Конго", "Республика Корея", "Россия", "Руанда", "Румыния", "Сальвадор", "Сан-Марино", "Сан-Томе и Принсипи", "Саудовская Аравия", "Свазиленд", "Сенегал", "Сент-Китс и Невис", "Сент-Люсия", "Сербия", "Сингапур", "Сирия", "Словакия", "Словения", "Соломоновы острова", "Сомали", "Судан", "Суринам", "США", "Сьерра-Леоне", "Таджикистан", "Таиланд", "Тайвань", "Танзания", "Того", "Тонга", "Тринидад и Тобаго", "Тунис", "Туркменистан", "Турция", "Уганда", "Узбекистан", "Украина", "Уругвай", "Фиджи", "Филиппины", "Финляндия", "Франция", "Французская Гвиана", "Хорватия", "Центральноафриканская Республика", "Чад", "Черногория", "Чехия", "Чили", "Швейцария", "Швеция", "Шри-Ланка", "Эквадор", "Экваториальная Гвинея", "Эритрея", "Эстония", "Эфиопия", "ЮАР", "Ямайка", "Япония"],
		form = document.querySelector('.form'),
		country = document.querySelector('#country'),
		list = document.querySelector('#list');

// Функция создания div-элементов со старанами
function createCount() {
	for (let i = 0; i < countries.length; i++) {
		let count = document.createElement('div'),
				divPos = document.getElementById('list');
		count.className = `div_${[i]}`;
		count.textContent = `${countries[i]}`;
		divPos.appendChild(count);
	}
}
// Функция скрывания div-элементов со старанами
function hideCount() {
	for (let i = 0; i < countries.length; i++) {
		let classCount = document.querySelector(`.div_${i}`);
				
		classCount.setAttribute("hidden", "true");
	}
}

createCount();
hideCount();

// Событие на ввод 
country.addEventListener('input', function(e) {
	let countryVal = e.target.value,
			regExp = new RegExp(countryVal,'i'),
			firstSym = countryVal.charAt(0);
			hideCount();
	if(countryVal.match(/[а-я]/i)) {
		console.log(country.value);
		for (let i = 0; i < countries.length; i++) {
			// Проверка первого символа вне зависимости от регистра
			if(firstSym.toUpperCase() == countries[i].charAt(0) || firstSym == countries[i].charAt(0)){
				if(countries[i].match(regExp)) {
					let classCount = document.querySelector(`.div_${i}`);
					classCount.removeAttribute("hidden", "true");
					console.log(countries[i]);
				} 			
			}
		}
	}
});

// Событие на выбор элемента по клику
list.addEventListener('click', function(e) {
	let target = e.target.innerHTML;
	console.log(target);
	country.value = target;
	// Скрывание выдачи поле выбора элемента
	hideCount();

});

